Revit 2024 API
Alignment.Get Method (Element)
 Returns an Alignment object given a Revit alignment element.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public static Alignment Get(
	Element alignmentElement
)
Visual Basic
Public Shared Function Get ( _
	alignmentElement As Element _
) As Alignment
Visual C++
public:
static Alignment^ Get(
	Element^ alignmentElement
)
Parameters
alignmentElement
Type: Autodesk.Revit.DB.Element
The alignment element.
Return Value
An Alignment for this element, or null if none found.
See Also
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace